// Лабораторная работа 1.2.7
// Финансовые формулы

// Наращение по сложным процентам - "проценты каждый период начисляются на уже накопленную сумму, а не на начальную".
// F = P * (1 + r)^n

#include <stdio.h>
#include <math.h>
#include <Windows.h>

void l127() {
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);

	double P; // изначальная сумма
	int r_percent; // ставка за один период в ПРОЦЕНТАХ (!!!)
	int n; // число периодов, годы

	printf("Введите изначальную сумму в рублях: ");
	scanf_s("%lf", &P);

	printf("Введите ставку за один период в ПРОЦЕНТАХ: ");
	scanf_s("%d", &r_percent);
	double r = r_percent / 100.0; // ставка за один год в ДОЛЯХ

	printf("Введите количество лет (периодов): ");
	scanf_s("%d", &n);

	double F = P * pow(1 + r, n); // вычисление сложных процентов
	double profit = F - P; // вычисление прибыли
	printf("Ваша прибыль через %d при капитале в %.2lf RUB и ставке %d%%: %.1lf RUB", n, P, r_percent, profit);
}

// Использовал double, так как float уменьшает точность и может дать мусор.